[
	{
		"id": "beginningFragment",
		"avatar": "protagonist",
		"content": "Many years ago there lived in Erzurum a certain poor old man named Brother Nerses.",
		"choices":
		[
			{"gotoId": "intro1"}
		],
		"conditions": []
	},
	
	{
		"id": "intro1",
		"choiceLabel": "Next",
		"avatar": "protagonist",
		"content": "Brother Nerses had once been a very rich man. He was the scion of a distinguished family greatly honored by governors and ministers. But he suffered great misfortunes and completely failed in life.",
		"choices":
		[
			{"gotoId": "intro2"}
		],
		"conditions": []
	},

	{
		"id": "intro2",
		"choiceLabel": "Next",
		"avatar": "protagonist",
		"content": "Brother Nerses was so bewildered, so disappointed and so discouraged that life at last meant absolutely nothing to him, and he led a drab life, loathing all his neighbors.",
		"choices":
		[
			{"gotoId": "intro3"}
		],
		"conditions": []
	},

	{
		"id": "intro3",
		"choiceLabel": "Next",
		"avatar": "protagonist",
		"content": "Although his house was dilapidated and in ruins, the signs of past glory could be seen on its exterior: even his old and shabby clothes showed that they were once first-rate. He had grown old and wrinkled and a bit hunchbacked but he still preserved his magnanimity. He was definitely poor and destitute, needing the help of neighbors and friends, yet he never stooped to beg or live on the pity of other people.",
		"choices":
		[
			{"gotoId": "intro4"}
		],
		"conditions": []
	},

	{
		"id": "intro4",
		"choiceLabel": "Next",
		"avatar": "protagonist",
		"content": "Once, Brother Nerses visited the market, and as he was passing the butcher's, Nikoghos Agha, one of the rich townsmen, bought a sheep's lung, liver, and heart.",
		"choices":
		[
			{"gotoId": "intro5"}
		],
		"conditions": []
	},

	{
		"id": "intro5",
		"choiceLabel": "Next",
		"avatar": "protagonist",
		"content": "Having lived in Constantinople for a number of years, Nikoghos Agha talked fluent Greek, and for this reason and in order to distinguish him from other Nikoghoses in the city, people called him Nikoghos the Greek.",
		"choices":
		[
			{"gotoId": "choice1"}
		],
		"conditions": []
	},

	{
		"id": "choice1",
		"choiceLabel": "Next",
		"avatar": "protagonist",
		"content": "\"Take this lung home, Brother Nerses, it's for you!\" Nikoghos Agha said, and reached out his hand with a sheep’s lung in it, for Brother Nerses to take.",
		"choices":
		[
			{"gotoId": "choice1.a"},
			{"gotoId": "choice1.b"}
		],
		"conditions": []
	},

	{
		"id": "choice1.a",
		"choiceLabel": "Accept the lung",
		"avatar": "protagonist",
		"content": "\"Thank you,\" Brother Nerses answered and, taking the lung from his hand.",
		"choices":
		[
			{"gotoId": "aftermath1"}
		],
		"conditions": []
	},

	{
		"id": "choice1.b",
		"choiceLabel": "Reject the lung",
		"avatar": "protagonist",
		"content": "\"I appreciate your efforts, Nikoghos Agha,” Brother Nerses replied, “but I should not take this meat from you.\"",
		"choices":
		[
			{"gotoId": "choice1.b.aftermath"}
		],
		"conditions": []
	},	

	{
		"id": "choice1.b.aftermath",
		"choiceLabel": "Next",
		"avatar": "protagonist",
		"content": "\"Why is that, Brother Nerses?\" Nikoghos Agha exclaimed. \"Can’t a well-intentioned man give a helping hand to his brother in need?\"",
		"choices":
		[
			{"gotoId": "choice1.b.choice2.a"},
			{"gotoId": "choice1.b.choice2.b"}
		],
		"conditions": []
	},

	{
		"id": "choice1.b.choice2.a",
		"choiceLabel": "\"I don't want to owe you.\"",
		"avatar": "protagonist",
		"content": "\"I don’t really want to be indebted to you,\" Brother Nerses said. \"You know I’m barely making ends meet right now,\" he added.",
		"choices":
		[
			{"gotoId": "choice1.b.choice2.a.aftermath"}
		],
		"conditions": []
	},

	{
		"id": "choice1.b.choice2.b",
		"choiceLabel": "\"I don't need it, give it to someone else.\"",
		"avatar": "protagonist",
		"content": "\"You see, my man,\" Brother Nerses answered, \"I already got enough meat from our neighbors for dinner. So you’d better give this to someone who needs it more.\" Just as Nikoghos Agha was about to open his mouth to scoff, Brother Nerses walked away in a hustle to escape his pretentious flattery.",
		"choices":
		[
			{"gotoId": "endingFragment"}
		],
		"conditions": []
	},

	{
		"id": "choice1.b.choice2.a.aftermath",
		"choiceLabel": "Next",
		"avatar": "protagonist",
		"content": "\"What are you talking about, dear brother,\" Nikoghos Agha said. \"My present comes from the bottom of my heart,\" he continued, \"and you won’t be no debtor to me. Have it.\" Nikoghos Agha shoved the lung into Nerses’ hands, and he had no choice other than to take it.",
		"choices":
		[
			{"gotoId": "aftermath1"}
		],
		"conditions": []
	},

	{
		"id": "aftermath1",
		"choiceLabel": "Next",
		"avatar": "protagonist",
		"content": "Shortly after, Nerses walked homeward with Nikoghos Agha.",
		"choices":
		[
			{"gotoId": "endingFragment"}
		],
		"conditions": []
	},

	{
		"id": "endingFragment",
		"avatar": "protagonist",
		"choiceLabel" : "Continue",
		"content": "This is the end of the story. You have chosen options that lead to a logical ending of the narrative.",
		"choices":
		[
		  {"gotoId": "dummyEnding"}
		],
		"conditions": [],
		"effects":
		[
		  "set finishExampleScene true"
		]
	},

	{
		"id": "dummyEnding",
		"avatar": "protagonist",
		"choiceLabel" : "[That's the end]",
		"content": "",
		"conditions": []
	}
]